KnightWXW/STM32Demo/030.停止模式+对射式红外传感器计次/Hardware/CountSensor.c
#include "stm32f10x.h" // Device header

uint16_t CountSensor_Count; // 全局变量,用于传感器的计数

/**
 * @description: 传感器初始化
 * @return: {*}
 */
void CountSensor_Init(uint16_t GPIO_Pin)
{
    // 开启时钟
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE); // GPIOB
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);  // AFIO,外部中断必须开启AFIO的时钟

    // GPIO初始化
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;     // GPIO模式,复用推挽输出模式
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin;           // GPIO引脚,PIN 引脚
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; // GPIO速度,50MHz
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    // AFIO选择中断引脚
    GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource14); // 将外部中断的14号线映射到GPIOB，即选择PB14为外部中断引脚

    // EXTI初始化
    EXTI_InitTypeDef EXTI_InitStructure;
    EXTI_InitStructure.EXTI_Line = EXTI_Line14;             // 选择配置外部中断的14号线
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;               // 指定外部中断线使能
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;     // 指定外部中断线为中断模式
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling; // 指定外部中断线为下降沿触发
    EXTI_Init(&EXTI_InitStructure);

    // NVIC中断分组
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); // 配置NVIC为分组2

    // NVIC配置
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel = EXTI15_10_IRQn;      // 选择配置NVIC的EXTI15_10线
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;           // 指定NVIC线路使能
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1; // 指定NVIC线路的抢占优先级为1
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;        // 指定NVIC线路的响应优先级为1
    NVIC_Init(&NVIC_InitStructure);
}

/**
 * @description: 获取传感器的计数值
 * @return: {*} 计数值,范围:0~65535
 */
uint16_t CountSensor_Get(void)
{
    return CountSensor_Count;
}

/**
 * @description: EXTI15_10外部中断函数
 * @return: {*}
 * 注意事项：此函数为中断函数,无需调用,中断触发后自动执行
 *           函数名为预留的指定名称,可以从启动文件复制
 *           请确保函数名正确,不能有任何差异,否则中断函数将不能进入
 */
void EXTI15_10_IRQHandler(void)
{
    if (EXTI_GetITStatus(EXTI_Line14) == SET) // 判断是否是外部中断14号线触发的中断
    {
        // 如果出现数据乱跳的现象,可再次判断引脚电平,以避免抖动
        if (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_14) == 0)
        {
            CountSensor_Count++; // 计数值自增一次
        }
        EXTI_ClearITPendingBit(EXTI_Line14); // 清除外部中断14号线的中断标志位
                                             // 中断标志位必须清除
                                             // 否则中断将连续不断地触发,导致主程序卡死
    }
}
